package alibaba.day_20170718;

/**
 * 2017阿里菜鸟7月内推<许海龙>在线编程测试
 * <p>
 * 浩瀚的宇宙，是否存在与我们世界相似的平行世界呢？自古以来，探索宇宙一直是人类的一个愿望。
 * 我们已知的是，我们的一生生活在四维空间里，这四维分别是横轴、纵轴、高度、时间。
 * 而我们不能确认也不能否认有五维空间的存在，第五维我们暂且称之为曲率。
 * 假设宇宙是五维的，而你在{ 0L, 0L, 0L, 0L, 0L } 这一空间，拥有时空穿梭的技能。
 * 但是如果进行时空移动需要耗费一定的燃料。 在横轴、纵轴、高度 三维间移动是根据移动单位燃料单位为1.
 * 在时间穿梭方面，移动单位燃料单位为10； 在曲率维度移动单位燃料为100；
 * 每次移动距离不限，但是维度唯一，即要么是横轴、要么纵轴，不能斜向移动。
 * 在宇宙中，有n个你的同伴在等待你解救，他们的坐标系统会提供给你，你需要移动到这些坐标解救他们，并回到你的位置。
 * 请你计算输出最小燃料是多少？
 * <p>
 * 输入示例：
 * 2
 * 1 2 3 4 5
 * 6 7 8 9 10
 *
 * @author YiJie  2017/7/21
 **/
public class MinFuel {
}
